In [191]:
import pandas as pd

FICHEROS_CSV = [
            'data_dictionary.csv', 'order_details.csv',
            'orders.csv', 'pizza_types.csv', 'pizzas.csv']

In [192]:
i = 1
df = pd.read_csv(FICHEROS_CSV[i], sep=';', encoding='cp1252')

In [193]:
def cambio_nan(nan):
        '''
        Como hay pedido, como poco tiene que haber 1 pizza
        '''
        try:
                nan = int(nan)
                if nan < 0:
                        nan = -1*nan

                return nan
        except:
                return 1

In [194]:
df['quantity'] = df['quantity'].apply(cambio_nan)
df

       order_details_id  order_id        pizza_id  quantity
0                 21671      9513      cali-ckn-m         1
1                 17259      7591  green garden s         1
2                 19844      8724    the-greek-xl         1
3                 24185     10625             NaN         1
4                 13779      6037      thai_ckn_m         1
...                 ...       ...             ...       ...
48615             31782     14027   classic dlx s         1
48616             24419     10731     the_greek_m         1
48617             31389     13858   classic_dlx_l         1
48618             32757     14481             NaN         1
48619             32405     14321      cali-ckn-l         1

[48620 rows x 4 columns]

In [195]:
df = df.fillna(method='ffill')

In [196]:
from re import sub


def revisar_pizzas(pizza):
    '''
    Comprueba los fallos más comunes a la hora de
    escribir un pedido
    '''
    separadores = ['-', ' ']
    for separador in separadores:
        if separador in pizza:
            pizza = sub(separador, '_', pizza)
    
    if '@' in pizza:
        pizza = sub('@', 'a', pizza)

    if '0' in pizza:
        pizza = sub('0', 'o', pizza)

    if '3' in pizza:
        pizza = sub('3', 'e', pizza)

    return pizza

In [197]:
df['pizza_id'] = df['pizza_id'].apply(revisar_pizzas)

In [198]:
pizzas = []
for pizza in df['pizza_id']:
    if not pizza in pizzas:
        pizzas.append(pizza)

print(len(pizzas))

91

In [199]:
df_fechas = pd.read_csv(FICHEROS_CSV[2], sep=';', encoding='cp1252')
#df_fechas = df_fechas.fillna(method='bfill')
df_fechas

       order_id                        date         time
0          8886                 May 29 2016     18:58 PM
1         11424                  2016-07-10     14:36:32
2         19361  Saturday,26 November, 2016     18:42 PM
3          4489                  2016-03-17          NaN
4          6838                         NaN     15:09:12
...         ...                         ...          ...
21345      1989   Tuesday,02 February, 2016  21H 15M 17S
21346      3795                  Mar 5 2016          NaN
21347      6474           19-04-16 16:20:01          NaN
21348     20125                  2016-12-08     18:12 PM
21349      3602           02-03-16 14:43:05  00H 00M 00S

[21350 rows x 3 columns]

In [200]:
def arreglo_fechas(fecha):
    if not isinstance(fecha, str):
        return float('Nan')
    if '.' in fecha:
        return float('Nan')
    
    return pd.Timestamp(fecha).date()

In [201]:
df_fechas['date'] = df_fechas['date'].apply(arreglo_fechas)
df_fechas = df_fechas.fillna(method='bfill')

In [202]:
df_fechas.pop('time')
df_fechas

       order_id        date
0          8886  2016-05-29
1         11424  2016-07-10
2         19361  2016-11-26
3          4489  2016-03-17
4          6838  2016-04-30
...         ...         ...
21345      1989  2016-02-02
21346      3795  2016-03-05
21347      6474  2016-04-19
21348     20125  2016-12-08
21349      3602  2016-02-03

[21350 rows x 2 columns]

In [203]:
df_fechas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21350 entries, 0 to 21349
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  21350 non-null  int64
 1   date      21350 non-null  object
dtypes: int64(1), object(1)
memory usage: 333.7+ KB